{
    "welcome": {
        "id": "welcome",
        "title": "Welcome",
        "elevator_speech": [
            "Hello! My name is Nikita. I am a future software engineer currently studying computer science at one of the most reputable French engineering schools, the ENSEEIHT. I'm specializing in software development, particularly in the car industry. This is one of the reasons why I'm currently working as an apprentice Android developer for Ampere Software Technology.",
            "As you might have guessed by now, this is my e-portfolio website. Here, you can find some of the most important information about my current studies and the projects I'm working on. Additionally, you can also find more personal facts about me, especially the activities I pursue outside of school or work (sports, civic engagement, people who inspire me).",
            "Enjoy browsing! ;)"
        ]
    },
    "engineering_course": {
        "id": "engineering_course",
        "title": "Engineering course",
        "iut": {
            "title": "IUT de Saint-Malo",
            "link": "https://iut-stmalo.univ-rennes.fr/",
            "description": "I began my journey in IT by obtaining a bachelor's degree in Networks & Telecommunications at the IUT of Saint-Malo, France. During these two years, I gained solid knowledge in several domains of IT such as networking, telecommunications and programming. While studying at the university, I was also 'working' as a network technician apprentice at the departmental council of Finistère (29), a valuable experience that allowed me to consolidate the basics I had learned at the IUT by working on real projects.",
            "projects_intro": "Speaking of projects, here are some of the ones I worked on during my time at university and at 'work.'",
            "projects": [
                {
                    "title": "Network automation tool",
                    "tech": [
                        "Python",
                        "Ansible",
                        "Virtualization"
                    ],
                    "img": "/projects/iut/network.png",
                    "description": "For my final IUT project, I created a network automation tool for my company (Dept. Council of Finistère). The goal was to develop a powerful yet easy-to-use software that any technician could quickly get to grips with. Based on Python and Ansible, this tool generates network configurations and directly applies them to hundreds of devices, saving significant time and reducing errors."
                },
                {
                    "title": "Graduation ceremony website",
                    "tech": [
                        "HTML",
                        "CSS",
                        "Javascript"
                    ],
                    "img": "/projects/iut/rdd.png",
                    "description": "Another major project I worked on was the creation of a website for the graduation ceremony of the Network & Telecommunications department. This website provided future graduates with all the essential information about the ceremony and allowed them to reserve their places directly online. I primarily worked the front-end of the website, while other students of my group developped the back-end side."
                },
                {
                    "title": "WEI Website",
                    "tech": [
                        "HTML",
                        "CSS",
                        "Javascript"
                    ],
                    "img": "/projects/iut/wei.png",
                    "description": "One of my smaller projects was the creation of another website for my university. Each year, the Student Union organizes a so-called 'weekend of integration' for new students. My role in this project was to design and create the website, providing potential participants with all the information they might be interested in before getting their tickets."
                }
            ]
        },
        "enseeiht": {
            "title": "ENSEEIHT",
            "link": "https://www.enseeiht.fr/fr/index.html",
            "description": "At this stage of my career, I am a first-year computer science engineering student at the ENSEEIHT (École nationale supérieure d'électrotechnique, d'électronique, d'informatique, d'hydraulique et des télécommunications). I'm also an apprentice Android developer for Ampere Software Technology, a branch of Renault Group. At ENSEEIHT, I primarily study computer science, programming, mathematics, and soft skills. My apprenticeship allows me to apply what I learn at school by developing onboard applications for Renault Group's cars and testing them directly on the vehicles. Sounds cool, doesn't it?",
            "projects_intro": "Here are some of my current projects, both personal and professional.",
            "projects": [
                {
                    "title": "Alpine Telemetrics",
                    "tech": [
                        "Kotlin",
                        "Reactive Programming"
                    ],
                    "img": "/projects/enseeiht/alpine.png",
                    "description": "Alpine Telemetrics is the project I am working on at Ampere. It is an onboard application for the new series of Alpine cars, giving drivers the ability to gather live information about their vehicles, such as G-force, lap times, brake or tire temperatures and so on. It was conceived as a mini video game inside your car to enhance track performance, particularly through challenges and built-in coaching tutorials."
                },
                {
                    "title": "Rennes Immobilier",
                    "tech": [
                        "React",
                        "Tailwind"
                    ],
                    "img": "/projects/enseeiht/rennes.png",
                    "description": "This is one of the biggest projects I have worked on so far. Rennes Immobilier is an Airbnb-like website that I'm developing with an associate. While he handles the back-end, I am responsible for the UI/UX design, as well as the front-end development."
                }
            ]
        }, 
        "coming_soon": {
            "title": "Coming soon...",
            "description": "Well... this section's title is pretty self-explanatory, isn't it? At the moment, I can't predict the exact path my career will take after graduating from ENSEEIHT. All I know is that I enjoy what I’m doing and plan to continue in this field of IT for some time after graduation. Time will tell!"
        }
    },
    "international": {
        "id": "international",
        "title": "International",
        "description": "An international mobility is an essential part of any engineering course in France. Thus, before graduating from ENSEEIHT, I must either complete an internship abroad or study at a foreign university. Since I’ve just started my course, the urgency of finding this experience isn’t pressing yet, but I already have some destinations in mind. Here are some of them.",
        "destinations": [
            {
                "country": "Europe",
                "img": "/8bit_images/flag_eu.png",
                "description": "My desire to study in Europe, particularly in the UK, stems from my goal of improving my English skills. Attending Cranfield University would allow me to acquire both technical knowledge and the English immersion experience I currently lack.",
                "universities": [
                    {
                        "name": "Cranfield University, UK",
                        "link": "https://www.cranfield.ac.uk/"
                    }
                ]
            },
            {
                "country": "North America",
                "img": [
                    "/8bit_images/flag_us.png",
                    "/8bit_images/flag_ca.png"
                ],
                "description": "North America, particularly the United States and Canada, is among my top choice destinations. I aspire to pursue a career in the US, and this opportunity could be the first step in that journey. Two universities I’m interested in are Georgia Tech and ÉTS Montreal.",
                "universities": [
                    {
                        "name": "Georgia Tech",
                        "link": "https://www.gatech.edu/"
                    },
                    {
                        "name": "ÉTS Montreal",
                        "link": "https://www.etsmtl.ca/"
                    }
                ]
            },
            {
                "country": "Russia",
                "img": "/8bit_images/flag_ru.png",
                "description": "Being a native Russian speaker who has primarily studied in France, the prospect of studying at a Russian university intrigues me, especially knowing that Saint-Petersburg State Institute of Technology is one of the country’s leading institutions.",
                "universities": [
                    {
                        "name": "St. Petersburg State Institute of Technology",
                        "link": "https://spbti.ru/index-eng"
                    }
                ]
            }
        ]
    },
    "civic_engagement": {
        "id": "civic_engagement",
        "title": "Civic engagement",
        "experiences": [
            {
                "title": "Toulouse Run Experience",
                "img": "/civic_engagement/toulouse_run_experience.png",
                "date": "November 10, 2024",
                "duration": 6,
                "description": "My first-ever civic engagement experience was volunteering at this year's Toulouse Marathon. My task was to prepare food and drink stands for the runners arriving at the marathon village, located at the race's finish line."
            }
        ]
    },
    "other": {
        "id": "other",
        "title": "Other",
        "tabs": [
            {
                "title": "Basket-Ball",
                "fun_fact": {
                    "text": "LeBron and Bronny James are the first father-son NBA duo.",
                    "url": "https://www.nba.com/news/lebron-bronny-james-make-history-play-together"
                },
                "description": "One of my two favorite sports is basketball. I started playing it in middle school, and I am still passionate about the game. This passion led me to join one of ENSEEIHT’s basketball teams, where I continue to practice and hone skills that are valuable even off the court, such as teamwork.",
                "img": "/8bit_images/miami_heat.png",
                "button": {
                    "present": true,
                    "text": "Follow my favorite NBA team",
                    "img": "/8bit_images/nba.png",
                    "url": "https://www.nba.com/stats/team/1610612748"
                }
            },
            {
                "title": "BMX Freestyle",
                "fun_fact": {
                    "text": "Three French riders sweep the podium in Paris 2024 BMX racing.",
                    "url": "https://olympics.com/fr/paris-2024/resultats/cyclisme-bmx-racing/hommes/fnl-000100--"
                },
                "description": "My other favorite sport is BMX Freestyle, an extreme sport that recently became an Olympic discipline. In competitions, the goal is to perform the most spectacular tricks, often involving flying off ramps, rotations, or flips, to achieve the highest score from the jury. Winning requires creativity — a skill I find equally essential in my professional career.",
                "img": "/8bit_images/bmx_1.png",
                "button": {
                    "present": true,
                    "text": "Take a look at my favorite BMX video",
                    "img": "/8bit_images/youtube.png",
                    "url": "https://www.youtube.com/watch?v=-GRkooVigb0&t=2s"
                }
            },
            {
                "title": "Rubik's Cube",
                "fun_fact": {
                    "text": "The current 3x3 world record is 3'13''.",
                    "url": "https://www.worldcubeassociation.org/results/records"
                },
                "description": "One of my hobbies is Rubik’s Cube solving, also known as speed cubing. Solving a 3x3 cube involves memorizing hundreds of unique algorithms and enhances both memory and problem-solving skills, which are crucial in IT engineering.",
                "img": "/8bit_images/rubiks_cube.png",
                "button": {
                    "present": false,
                    "text": "",
                    "img": "",
                    "url": ""
                }
            }
        ]
    },
    "career_development": {
        "id": "career_development",
        "title": "Career development",
        "video": "/career_development/elevator_pitch.mp4",        
        "resume": {
            "en": "/career_development/resume/CV_ZIUZIN_NIKITA_ENG.pdf",
            "fr": "/career_development/resume/CV_ZIUZIN_NIKITA_FR.pdf"
        },
        "profiles": [
            {
                "name": "Аlеxаndrе РАUL",
                "url": "https://www.linkedin.com/in/alexpaul26/",
                "img": "/career_development/character_1.png",
                "situation": "student",
                "institution": {
                    "name": "ENSEEIHT",
                    "url": "https://www.enseeiht.fr/fr/index.html"
                },
                "description": "Alexandre is currently studying electronics at ENSEEIHT. His profile caught my attention because he is preparing for a semester at Georgia Tech, USA, one of my top choices for international mobility. Our exchange provided valuable insights about Georgia Tech."
            },
            {
                "name": "Jаsоn MАIRЕ",
                "url": "",
                "img": "/career_development/character_2.png",
                "situation": "employee",
                "institution": {
                    "name": "Ampere",
                    "url": "https://www.ampere.cars/"
                },
                "description": "Jаsоn is a full-stack developer at Ampere and also my apprenticeship mentor. As I am following a similar career path, I didn’t miss the opportunity to ask him about his studies and the skills he uses daily."
            },
            {
                "name": "Lucilе Sсhnеidеr",
                "url": "",
                "img": "/career_development/character_3.png",
                "situation": "employee",
                "institution": {
                    "name": "Ampere",
                    "url": "https://www.ampere.cars/"
                },
                "description": "Lucilе is one of my colleagues at Ampere, working as an HMI android developer. She is an ENSEEIHT's alumni from the computer science class of 2014-2017. Exchanging on her post-graduation experience was very insightful, as I was particularly seeking to discover career paths that began similarly to mine."
            }
        ]
    },
    "links": {
        "linkedin": "https://www.linkedin.com/in/nikita-ziuzin/",
        "youtube": "https://www.youtube.com/@nikuiz",
        "ampere": "https://www.ampere.cars/",
        "enseeiht": "https://www.enseeiht.fr/fr/index.html",
        "github": "https://github.com/nikuizzz",
        "email": "nikitazuz@gmail.com"
    }
}