{
    "welcome": {
        "title": "Welcome",
        "elevator_speech": [
            "Hello! My name is Nikita. I am a future software engineer currently studying computer science at one of the most reputed French engineering schools, the ENSEEIHT. I'm trying to specialize in software development and especially the car industry, which is one of the reasons why I'm currently working as an apprentice android developer for Ampere Software Technology.",
            "As you could have guessed by now, this is my e-portfolio website. Here you can find some of the most important information about my current studies or the projects I'm working on. Besides that, you can also find some more personal facts about me, especially the stuff I do outside of school/work (sports, civic engagement, people that inspire me).",
            "Have a good browsing! ;)"
        ]
    },
    "engineering_course": {
        "title": "Engineering course",
        "iut": {
            "title": "IUT de Saint-Malo",
            "link": "https://iut-stmalo.univ-rennes.fr/",
            "description": "I've started my journey in the IT sphere by obtaining a bachelor's degree in Networks & Telecommunications at the IUT of Saint-Malo, in France. During these two years I've gained solid knowledge in several domains of IT,such as networking, telecommunications and programming. All while studying at the university, I was also \"working\"as a network technician apprentice at the departamental council of Finistère (29), a precious experience that allowedme to consolidate the basics that I've obtained at the IUT by working on real projects.",
            "projects_intro": "Talking about projects, here as some of them, realized both at university and at \"work\".",
            "projects": [
                {
                    "title": "Network automation tool",
                    "tech": [
                        "Python",
                        "Ansible",
                        "Virtualization"
                    ],
                    "img": "/projects/iut/network.png",
                    "description": "For my final IUT project, I had to create a network automation tool for my company (dpt. Council of Finistère). The goal was to create a powerful yet ease-to-use software that any technician could quickly get to grips with. Based on Python and Ansible, this tool can generate network configurations and directly apply them on hundreds of equipments (a task that formerly requested considerable amounts of time and was a big source of errors)."
                },
                {
                    "title": "Graduation ceremony website",
                    "tech": [
                        "HTML",
                        "CSS",
                        "Javascript"
                    ],
                    "img": "/projects/iut/rdd.png",
                    "description": "Another big project that I had the opportunity to work on was the creation of a website for the graduation ceremony of the Network & Telecommunications department. This website provided future graduates all the important information about the ceremony and also gave them to opportunity to get their places, directly on the website. I mainly participated in the front-end development, while my group worked on the back-end."
                },
                {
                    "title": "WEI Website",
                    "tech": [
                        "HTML",
                        "CSS",
                        "Javascript"
                    ],
                    "img": "/projects/iut/wei.png",
                    "description": "One of some less significant projects of mine was the creation of another website for my university. Each year, the BDE (Student Leadership Office) organizes a so called \"week-end of integration\" for the new students. My goal in this project was to design and create the website, providing potential participants with every bit of information they could need."
                }
            ]
        },
        "enseeiht": {
            "title": "ENSEEIHT",
            "link": "https://www.enseeiht.fr/fr/index.html",
            "description": "At the current stage of my carreer I am a first-year computer science engineer student at the ENSEEIHT (École nationale supérieure d'électrotechnique, d'électronique, d'informatique, d'hydraulique et des télécommunications). I'm also an apprentice android developper for a branch of Renault Group, Ampere Software Technology. At the ENSEEIHT, I primarly study computer science, programming, mathematics and soft skills. On the other hand, my apprenticeship allows me to put in work the things I learn at school, mostly by developping on-board applications for Renault Group's cars and then testing them on these same cars. Sounds cool, doesn't it?",
            "projects_intro": "Here are some of my current projects that are both personal and professionnal.",
            "projects": [
                {
                    "title": "Alpine Telemetrics",
                    "tech": [
                        "Kotlin",
                        "Reactive Programming"
                    ],
                    "img": "/projects/enseeiht/alpine.png",
                    "description": "Alpine Telemetrics is my current project at Ampere. It is an on-board application for the new series of Alpine cars that allows their drivers to gather some live information about their car, such as G-force, lap time, brake or tyres temperatures and many more. It was concepted as a mini video-game inside of your car that allows you to enhance your track performance, especially by completing some challenges or following built-in coaching tutorials."
                },
                {
                    "title": "Rennes Immobilier",
                    "tech": [
                        "React",
                        "Tailwind"
                    ],
                    "img": "/projects/enseeiht/rennes.png",
                    "description": "This is one of the biggest projects I have had the opportunity to work on, at this stage of my career. Rennes Immobilier is an Airbnb-like website that I'm currently working on with one of my friends from the IUT. While he's working on the back-end, I'm in charge of the UI/UX of Rennes Immobilier's website, as well as the front-end development itself."
                }
            ]
        }, 
        "coming_soon": {
            "title": "Coming soon...",
            "description": "Well... this section's name is pretty self-explanotary, isn't it? For the moment I cannot tell you (neither can I tell it to myself) what route my career will take after graduating from the ENSEEIHT. All I can say for now is that I like what I'm doing and I'd like to pursue in this field of IT for some part of my life after my graduation. But keep in mind that I am a very manual person, so there is a considerable possibility that in 10 years from now you would rather find me opening a garage than opening a tech start-up. Time will show everything!"
        }
    },
    "international": {
        "title": "International",
        "description": "An international mobility is an essential part of any engineering course in France. Thus, before graduating from the ENSEEIHT I will have to either do an internship abroad or go to an university in a foreign country. As I've just started my course, the urge of finding my future international experience is not pressant yet, however I already have some destinations in mind. Here are some of them.",
        "destinations": [
            {
                "country": "Europe",
                "src": "/8bit_images/flag_eu.png",
                "description": "My desire of studying in Europe and especially in the UK is feeded by my goal of improving my English skills. Going to Cranfield's University would allow me to acquire both technical skills and the english-studying experience I'm currently missing.",
                "universities": [
                    {
                        "name": "Cranfield University, UK",
                        "link": "https://www.cranfield.ac.uk/"
                    }
                ]
            },
            {
                "country": "North America",
                "src": [
                    "/8bit_images/flag_us.png",
                    "/8bit_images/flag_ca.png"
                ],
                "description": "North America and especially the United States and Canada are one of my most wanted destinations. I have a willing of pursuing my career in the US, therefore this opportunity could be the the first step of this difficult journey. Two of the universities I'm interested in are Georgia Techa and ÉTS Montreal.",
                "universities": [
                    {
                        "name": "Georgia Tech",
                        "link": "https://www.gatech.edu/"
                    },
                    {
                        "name": "ÉTS Montreal",
                        "link": "https://www.etsmtl.ca/"
                    }
                ]
            },
            {
                "country": "Russia",
                "src": "/8bit_images/flag_ru.png",
                "description": "Being a native russian speaker that mostly studied in France, the opportunity of studying in a russian university seems really interesting to me, especially knowing that Saint-Petersburg's State Institute of Technology is one of the best institutions in the country.",
                "universities": [
                    {
                        "name": "St. Petersburg State Institute of Technology",
                        "link": "https://spbti.ru/index-eng"
                    }
                ]
            }
        ]
    },
    "civic_engagement": {
        "title": "Civic engagement",
        "experiences": [
            {
                "title": "Toulouse Run Experience",
                "img": "/civic_engagement/toulouse_run_experience.png",
                "date": "10 Novembre 2024",
                "duration": 6,
                "description": "One of my first evert civic engagement experience was this year's Toulouse's marathon. As a volunteer, my mission was to prepare food and drink stands for the runners that were arriving at the marathon's village, situated right at the end of the race."
            }
        ]
    },
    "other": {
        "title": "Other",
        "tabs": [
            {
                "title": "Basket-Ball",
                "fun_fact": {
                    "text": "LeBron and Bronny James are the first father-son NBA duo.",
                    "url": "https://www.nba.com/news/lebron-bronny-james-make-history-play-together"
                },
                "description": "One of my (two) favorite sports is Basket-Ball. I've started playing it in middle school and I am still passionate about this game. This is one of the reasons I'm currently part of one of the ENSEEIHT's basket-ball teams. It allows me to keep practicing and enhancing some skills that may become useful even outside of the basket-ball court, for example team-working.",
                "img": "/8bit_images/miami_heat.png",
                "button": {
                    "present": true,
                    "text": "Follow my favorite NBA team",
                    "img": "/8bit_images/nba.png",
                    "url": "https://www.nba.com/stats/team/1610612748"
                }
            },
            {
                "title": "BMX Freestyle",
                "fun_fact": {
                    "text": "Three French riders sweep the podium in Paris 2024 BMX racing.",
                    "url": "https://olympics.com/fr/paris-2024/resultats/cyclisme-bmx-racing/hommes/fnl-000100--"
                },
                "description": "My other favorite sport is the BMX Freestyle - an extreme sport that recently became an olympic discipline. While competing, the goal is to accomplish the most spectacular tricks, ofter evolving flying out of ramps, rotating or flipping yourself in order to get the highest score by the jury. To win such competitions, riders have to invent new tricks often involving their creativity - a skill that is useful to me in my professionnal career.",
                "img": "/8bit_images/bmx_1.png",
                "button": {
                    "present": true,
                    "text": "Take a look at my favorite BMX video",
                    "img": "/8bit_images/youtube.png",
                    "url": "https://www.youtube.com/watch?v=-GRkooVigb0&t=2s"
                }
            },
            {
                "title": "Rubiks-Cube",
                "fun_fact": {
                    "text": "The current 3x3 world record is 3'13''.",
                    "url": "https://www.worldcubeassociation.org/results/records"
                },
                "description": "A favorite hobby of mine is Rubiks-Cube solving, also called speed cubing. Solving the 3x3 involves memorizing hundreds of unique algorithms and enhances both memory and problem solving, two essential skills in the IT engineering field.",
                "img": "/8bit_images/rubiks_cube.png",
                "button": {
                    "present": false,
                    "text": "",
                    "img": "",
                    "url": ""
                }
            }
        ]
    },
    "career_development": {
        "title": "Career development"
    },
    "links": {
        "linkedin": "https://www.linkedin.com/in/nikita-ziuzin/",
        "youtube": "https://www.youtube.com/@nikuiz"
    }
}